Heat Transfer/sphere_in_oil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       218628;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       219528;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       220428;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       221328;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       222228;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       223128;
    }
)

// ************************************************************************* //
